anhkhangluu/STM32/Firmware_IO/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

#include <cmsis_gcc.h>
#include <definition.h>
#include <dhcp.h>
#include <fatfs.h>
#include <ff.h>
#include <integer.h>
#include <LCD.h>
#include <main.h>
#include <math.h>
#include <mb.h>
#include <mbutils.h>
#include <port.h>
#include <rtc.h>
#include <stdbool.h>
#include <stdio.h>
#include <stm32f072xb.h>
#include <stm32f0xx.h>
#include <stm32f0xx_hal_def.h>
#include <stm32f0xx_hal_flash.h>
#include <stm32f0xx_hal_gpio.h>
#include <stm32f0xx_hal_rcc.h>
#include <stm32f0xx_hal_rcc_ex.h>
#include <stm32f0xx_hal_rtc.h>
#include <stm32f0xx_hal_spi.h>
#include <stm32f0xx_hal_tim.h>
#include <stm32f0xx_hal_tim_ex.h>
#include <stm32f0xx_hal_uart.h>
#include <stm32f0xx_hal_uart_ex.h>
#include <structer.h>
#include <sys/_stdint.h>
#include <timer.h>
#include <usb_device.h>
#include <w5500.h>
#include <wizchip_conf.h>
#include <W5500_config.h>

#include "../../io/io.h"
#include "../../screen/screen.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
//#define USART_DEBUG
#ifdef USART_DEBUG
#include "stdio.h"
#include "string.h"
#define USART_DEBUG_HANDLER		&huart3
#define PRINT_NETINFO(netInfo) do { 																					\
  HAL_UART_Transmit(USART_DEBUG_HANDLER, (uint8_t*)NETWORK_MSG, strlen(NETWORK_MSG), 100);											\
  sprintf(msg, MAC_MSG, netInfo.mac[0], netInfo.mac[1], netInfo.mac[2], netInfo.mac[3], netInfo.mac[4], netInfo.mac[5]);\
  HAL_UART_Transmit(USART_DEBUG_HANDLER, (uint8_t*)msg, strlen(msg), 100);															\
  sprintf(msg, IP_MSG, netInfo.ip[0], netInfo.ip[1], netInfo.ip[2], netInfo.ip[3]);										\
  HAL_UART_Transmit(USART_DEBUG_HANDLER, (uint8_t*)msg, strlen(msg), 100);															\
  sprintf(msg, NETMASK_MSG, netInfo.sn[0], netInfo.sn[1], netInfo.sn[2], netInfo.sn[3]);								\
  HAL_UART_Transmit(USART_DEBUG_HANDLER, (uint8_t*)msg, strlen(msg), 100);															\
  sprintf(msg, GW_MSG, netInfo.gw[0], netInfo.gw[1], netInfo.gw[2], netInfo.gw[3]);										\
  HAL_UART_Transmit(USART_DEBUG_HANDLER, (uint8_t*)msg, strlen(msg), 100);															\
} while(0)
#endif
#define DHCP_SOCKET     0
#define SNTP_SOCKET      1
#define HTTP_SOCKET     0
#define MBTCP_PORT      502

#define REG_INPUT_START       0x0001
#define REG_INPUT_NREGS       8

#define REG_HOLDING_START     0x0001
#define REG_HOLDING_NREGS     8

#define REG_COILS_START       0x0001
#define REG_COILS_SIZE        16

#define REG_DISCRETE_START    0x0001
#define REG_DISCRETE_SIZE     16
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim7;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
#ifdef USART_DEBUG
char msg[60];
#endif
/*----------------------------DHCP-----------------------------*/
uint8_t dhcp_buffer[1024];
volatile bool ip_assigned = false;

uint16_t usRegInputBuf[REG_INPUT_NREGS] = { 0x1000, 0x1001, 0x1002, 0x1003,
		0x1004, 0x1005, 0x1006, 0x1007 };
uint16_t usRegHoldingBuf[REG_HOLDING_NREGS] = { 0x2000, 0x2001, 0x2002, 0x2003,
		0x2004, 0x2005, 0x2006, 0x2007 };
uint8_t ucRegCoilsBuf[REG_COILS_SIZE / 8] = { 0xaa, 0xfe };
uint8_t ucRegDiscreteBuf[REG_DISCRETE_SIZE / 8] = { 0x98, 0x6e };
/*---------------------------------------------------*/

/*-------------SD card Fatfs-----------*/
FATFS fs;
FATFS *pfs;
FIL file;
FRESULT FOR; //file operation result
DWORD fre_clust;
uint32_t totalSpace, freeSpace;
/*-------------------------------------*/

/*----------------app.c----------------*/
static dataMeasure mdata = { { 0, 0, 0, 0, 0, 0 }, { 0, 0, 0, 0, 0, 0 } };

static Time mtime = { 23, 05, 21, 06, 00, 00 };

static button mbutton;
static input minput;
static sensor msensor;
static output moutput;
static ledStatus mledStatus;
static MeasureValue mcalibValue;
static MeasureValue mCurrentMeasureValue;
static MeasureValue mmeasureValue;
static setCalibValue msetCalibValue;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM7_Init(void);
/* USER CODE BEGIN PFP */
#ifdef USART_DEBUG
void send_uart(char *string, ...) {
	uint8_t len = strlen(string);
	HAL_UART_Transmit(&USART_DEBUG_HANDLER, (uint8_t*) string, len, HAL_MAX_DELAY); // transmit in blocking mode
}
#endif

void Callback_IPAssigned(void) {
	ip_assigned = true;
}
void Callback_IPConflict(void) {
	printf("Callback: IP conflict!\r\n");
}

static void process_SD_Card(void);
void W5500_init();

/*---------------app.c------------*/
static void app_SettingRtc(void);
static void app_SettingData(void);
static void app_GetEeprom(void);
static void app_Measurement(void);
static void app_SetCalibValue(void);
static void app_GetCalibValue(void);
static void app_CalculatorValue(CycleMeasure lcycleMeasure);
static void app_HisValue(void);
static void app_ClearAllOutput(void);
static void app_GotoMainScreen(uint8_t option);
static void app_SetCurrentMeasureValue(void);
static void app_GetCurrentMeasureValue(void);
static void app_TrigerOutputON(void);
static void app_TrigerOutputOFF(void);
static optionScreen_e_t app_optionMenu(void);
static void app_

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

