anhkhangluu/STM32/Firmware_IO/Core/Src/main.c
	if ((usAddress >= REG_HOLDING_START)
			&& (usAddress + usNRegs <= REG_HOLDING_START + REG_HOLDING_NREGS)) {
		iRegIndex = (int) (usAddress - REG_HOLDING_START);
		switch (eMode) {
		/* Pass current register values to the protocol stack. */
		case MB_REG_READ:
			while (usNRegs > 0) {
				*pucRegBuffer++ = (unsigned char) (usRegHoldingBuf[iRegIndex]
						>> 8);
				*pucRegBuffer++ = (unsigned char) (usRegHoldingBuf[iRegIndex]
						& 0xFF);
				iRegIndex++;
				usNRegs--;
			}
			break;
			/* Update current register values with new values from the protocol stack. */
		case MB_REG_WRITE:
			while (usNRegs > 0) {
				usRegHoldingBuf[iRegIndex] = *pucRegBuffer++ << 8;
				usRegHoldingBuf[iRegIndex] |= *pucRegBuffer++;
				iRegIndex++;
				usNRegs--;
			}
		}
	} else {
		eStatus = MB_ENOREG;
	}
	return eStatus;
}

eMBErrorCode eMBRegInputCB(UCHAR *pucRegBuffer, USHORT usAddress,
		USHORT usNRegs) {
	eMBErrorCode eStatus = MB_ENOERR;
	int iRegIndex;

	if ((usAddress >= REG_INPUT_START)
			&& (usAddress + usNRegs <= REG_INPUT_START + REG_INPUT_NREGS)) {
		iRegIndex = (int) (usAddress - REG_INPUT_START);
		while (usNRegs > 0) {
			*pucRegBuffer++ = (unsigned char) (usRegInputBuf[iRegIndex] >> 8);
			*pucRegBuffer++ = (unsigned char) (usRegInputBuf[iRegIndex] & 0xFF);
			iRegIndex++;
			usNRegs--;
		}
	} else {
		eStatus = MB_ENOREG;
	}

	return eStatus;
}

eMBErrorCode eMBRegCoilsCB(UCHAR *pucRegBuffer, USHORT usAddress,
		USHORT usNCoils, eMBRegisterMode eMode) {
	eMBErrorCode eStatus = MB_ENOERR;
	int iNCoils = (int) usNCoils;
	unsigned short usBitOffset;

	/* Check if we have registers mapped at this block. */
	if ((usAddress >= REG_COILS_START)
			&& (usAddress + usNCoils <= REG_COILS_START + REG_COILS_SIZE)) {
		usBitOffset = (unsigned short) (usAddress - REG_COILS_START);
		switch (eMode) {
		/* Read current values and pass to protocol stack. */
		case MB_REG_READ:
			while (iNCoils > 0) {
				*pucRegBuffer++ = xMBUtilGetBits(ucRegCoilsBuf, usBitOffset,
						(unsigned char) (iNCoils > 8 ? 8 : iNCoils));
				iNCoils -= 8;
				usBitOffset += 8;
			}
			break;
			/* Update current register values. */
		case MB_REG_WRITE:
			while (iNCoils > 0) {
				xMBUtilSetBits(ucRegCoilsBuf, usBitOffset,
						(unsigned char) (iNCoils > 8 ? 8 : iNCoils),
						*pucRegBuffer++);
				iNCoils -= 8;
				usBitOffset += 8;
			}
			break;
		}
	} else {
		eStatus = MB_ENOREG;
	}
	return eStatus;
}

eMBErrorCode eMBRegDiscreteCB(UCHAR *pucRegBuffer, USHORT usAddress,
		USHORT usNDiscrete) {
	eMBErrorCode eStatus = MB_ENOERR;
	short iNDiscrete = (short) usNDiscrete;
	unsigned short usBitOffset;

	/* Check if we have registers mapped at this block. */
	if ((usAddress >= REG_DISCRETE_START)
			&& (usAddress + usNDiscrete
					<= REG_DISCRETE_START + REG_DISCRETE_SIZE)) {
		usBitOffset = (unsigned short) (usAddress - REG_DISCRETE_START);
		while (iNDiscrete > 0) {
			*pucRegBuffer++ = xMBUtilGetBits(ucRegDiscreteBuf, usBitOffset,
					(unsigned char) (iNDiscrete > 8 ? 8 : iNDiscrete));
			iNDiscrete -= 8;
			usBitOffset += 8;
		}
	} else {
		eStatus = MB_ENOREG;
	}
	return eStatus;
}

static void process_SD_Card(void) {
	FATFS FatFs;
	FIL fil;	//file
	char buff[100];

	do {
		//mount SD card
		if (f_mount(&FatFs, "", 0) != FR_OK) //0 = mount late, 1 = mount now
				{
			break;
		}

		//Read size and free space of SD Card
		FATFS *pfs;
		DWORD fre_clust;
		uint32_t totalSpace;
		uint32_t freeSpace;

		if (f_getfree("", &fre_clust, &pfs) != FR_OK) {
			break;
		}
		totalSpace = (uint32_t) ((pfs->n_fatent - 2) * pfs->csize * 0.5);
		freeSpace = (uint32_t) (fre_clust * pfs->csize * 0.5);

		//Open file
		if (f_open(&fil, "test.txt", FA_READ | FA_OPEN_ALWAYS | FA_WRITE)
				!= FR_OK) //In this mode, it will create the file if file not existed
				{
			break;
		}

		//Write data to "test.txt"
		f_puts("This is a sample", &fil); //write string to file

		//Close file
		if (f_close(&fil) != FR_OK) {
			break;
		}

		//Open file
		if (f_open(&fil, "test2.txt", FA_READ) != FR_OK) {
			break; //if file d
		}
		//Read data in file
		f_gets(buff, sizeof(buff), &fil);

		//Close file
		if (f_close(&fil) != FR_OK) {
			break;
		}

#if 0
		//delete file
		if(f_unlink("test.txt") != FR_OK)
		{
			break;
		}
#endif

	} while (0);
	f_mount(NULL, "", 0); //unmount SD card

}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
	//this function will reach if have a rising edge appear on tim1
	if (htim1.Channel == HAL_TIM_ACTIVE_CHANNEL_1
			|| htim1.Channel == HAL_TIM_ACTIVE_CHANNEL_2) {

	}
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) { //should check
	if (htim == &htim7) {
		register uint8_t i;
		for (i = 0; i < MAX_TIME; i++) {
			if (TIME_RUN == mtimer[i].status) {
				mtimer[i].inc += 1;
				if (mtimer[i].inc >= mtimer[i].count) {
					mtimer[i].status = TIME_FINISH;
					mtimer[i].flat = 1;
				}
			}
		}
	}
}

// app.c
static void app_SettingRtc(void) {
	CycleTime cycle = SET_YEAR;
	uint8_t exit = 0;
	uint8_t tmp = 0;
	screen_Clear();
	do {
		/*set year*/
		if (SET_YEAR == cycle) {
			mtime = rtc_Now();
			screen_setDateTime(mtime, SET_YEAR);
			do {
				mbutton = io_getButton();
				if (_ON == mbutton.set) {
					tmp = (mtime.year >= 2000) ?
							(mtime.year - 2000) : (byte) mtime.year;
					tmp += 1;
					if (99 < tmp)
						tmp = 0;
					mtime.year = tmp + 2000;
					rtc_SetYear(mtime.year);
					screen_setDateTime(mtime, SET_YEAR);
					delay(TIME_WAIT);
				}
				if (_ON == mbutton.next) {
					cycle = SET_MONTH;
					while (_ON == io_getButton().next)
						;
				}
				if (_ON == mbutton.reset) {
					while (_ON == io_getButton().reset)
						;
					exit = 1;
					break;
				}
			} while (SET_YEAR == cycle);
		}
		/*set month*/
		if (SET_MONTH == cycle) {
			mtime = rtc_Now();
			screen_setDateTime(mtime, SET_MONTH);
			do {
				mbutton = io_getButton();
				if (_ON == mbutton.set) {
					mtime.month += 1;
					if (12 < mtime.month)
						mtime.month = 1;
					rtc_SetMonth(mtime.month);
					screen_setDateTime(mtime, SET_MONTH);
					delay(TIME_WAIT);
				}
				if (_ON == mbutton.next) {
					cycle = SET_DAY;
					while (_ON == io_getButton().next)
						;
				}
				if (_ON == mbutton.reset) {
					while (_ON == io_getButton().reset)
						;
					exit = 1;
					break;
				}
			} while (SET_MONTH == cycle);
		}
		/*set day*/
		if (SET_DAY == cycle) {
			mtime = rtc_Now();
			screen_setDateTime(mtime, SET_DAY);
			do {
				mbutton = io_getButton();
				if (1U == mbutton.set) {
					mtime.day += 1;
					if (31 < mtime.day)
						mtime.day = 1;
					rtc_SetDay(mtime.day);
					screen_setDateTime(mtime, SET_DAY);
					delay(TIME_WAIT);
				}
				if (_ON == mbutton.next) {
					cycle = SET_HOUR;
					while (_ON == io_getButton().next)
						;
				}
				if (_ON == mbutton.reset) {
					while (_ON == io_getButton().reset)
						;
					exit = 1;
					break;
				}
			} while (SET_DAY == cycle);
		}
		/*set hour*/
		if (SET_HOUR == cycle) {
			mtime = rtc_Now();
			screen_setDateTime(mtime, SET_HOUR);
			do {
				mbutton = io_getButton();
				if (_ON == mbutton.set) {
					mtime.hour += 1;
					if (59 < mtime.hour)
						mtime.hour = 1;
					rtc_SetHour(mtime.hour);
					rtc_SetSecond(0);
					screen_setDateTime(mtime, SET_HOUR);
					delay(TIME_WAIT);
				}
				if (_ON == mbutton.next) {
					cycle = SET_MINUTE;
					while (_ON == io_getButton().next)
						;
				}
				if (_ON == mbutton.reset) {
					while (0U == io_getButton().reset)
						;
					exit = 1;
					break;
				}
			} while (SET_HOUR == cycle);
		}
		/*set minute*/
		if (SET_MINUTE == cycle) {
			mtime = rtc_Now();
			screen_setDateTime(mtime, SET_MINUTE);
			do {
				mbutton = io_getButton();
				if (_ON == mbutton.set) {
					mtime.minute += 1;
					if (59 < mtime.minute)
						mtime.minute = 1;
					rtc_SetMinute(mtime.minute);
					rtc_SetSecond(0);
					screen_setDateTime(mtime, SET_MINUTE);
					delay(TIME_WAIT);
				}
				if (_ON == mbutton.next) {
					cycle = SET_YEAR;
					while (_ON == io_getButton().next)
						;
				}
				if (_ON == mbutton.reset) {
					while (_ON == io_getButton().reset)
						;
					exit = 1;
					break;
				}
			} while (SET_MINUTE == cycle);
		}
	} while (0 == exit);
	if (CALIBSET == msetCalibValue) {
		app_GotoMainScreen(CALIBSET);
	} else {
		app_GotoMainScreen(CALIBRESET);
	}
}

static void app_Measurement(void)
{
    CycleMeasure cycleMeasure = STOP;
    CycleMeasureSensor cycleMeasureX = SEN_STOP;
    CycleMeasureSensor cycleMeasureY = SEN_STOP;
    CycleMeasureSensor cycleMeasureZ = SEN_STOP;
    SensorChange XStatus = SENSORNOCHANGE;
    SensorChange YStatus = SENSORNOCHANGE;
    GetInputType getInput = GET_SENSOR;

