anhkhangluu/STM32/Firmware_IO/Core/Src/main.c
    mdata.coordinates.X = 0;
    mdata.coordinates.Y = 0;
    mdata.coordinates.Z = 0;
    mdata.coordinates.aX = 0;
    mdata.coordinates.aY = 0;
    mdata.mode = NONE;

    mmeasureValue.X1 = 0;
    mmeasureValue.Y1 = 0;
    mmeasureValue.X2 = 0;
    mmeasureValue.Y2 = 0;
    mmeasureValue.Z = 0;

    do
    {
        if(GET_BUTTON == getInput)
        {
            mbutton = io_getButton();
            minput = io_getInput();
        }
        else
        {
            minput = io_getInput();
            msensor = io_getSensor();
        }
        /********************************************## 1 ##*******************************************/
        /*Robot di chuyển tới vị trí P0 Robot xuất tín hiệu cho X10 cho phép quá trình bắt đầu*/
        if((STOP == cycleMeasure) && (_ON == minput.in0)) // X10=ON
        {
            app_ClearAllOutput();
            minput.in0 = _OFF;
            cycleMeasure = CLEARSENSOR;
            getInput = GET_SENSOR;
            timer_Start(TIMER_CLEARSENSOR, TIMERCLEARSENSOR);
            moutput.out0 = _OFF;
            moutput.out1 = _OFF;
            moutput.rl1 = _ON;
            io_setOutput(moutput);
//            DBG("cycleMeasure = CLEARSENSOR\n");
        }
        /********************************************## 2 ##*******************************************/
        /********************************************## 3 ##*******************************************/
        /*Waiting clear Sensor*/
        if((CLEARSENSOR == cycleMeasure) && (TIME_FINISH == timer_Status(TIMER_CLEARSENSOR)))
        {
            if((_OFF == msensor.s0) && (_OFF == msensor.s1))
            {
                moutput.rl1 = _OFF;
                moutput.out0 = _ON;
                moutput.out1 = _OFF;
                io_setOutput(moutput);
                msensor.s0 = _OFF;
                msensor.s1 = _OFF;
                getInput = GET_SENSOR;
                cycleMeasure = WAITMEASUREZ;
//                DBG("SENSOR OK\n");
            }
            else
            {
                moutput.rl1 = _OFF;
                moutput.out0 = _OFF;
                moutput.out1 = _OFF;
                io_setOutput(moutput);
                cycleMeasure  = ERROR;
//                DBG("SENSOR NOT OK\n");
            }
            getInput = GET_SENSOR;
        }
        /********************************************## 4 ##*******************************************/
        while ((WAITMEASUREZ == cycleMeasure) && (0 == GET_IN0))
        {
            minput = io_getInput();
            if(_ON == minput.in1) //C=1
            {
                /*Start couter*/
                timer_Start(TIMER_CLEARSENSOR, TIMEWAITX11);
                minput.in1 = _OFF;
                msensor.s0 = _OFF;
                msensor.s1 = _OFF;
                getInput = GET_SENSOR;
                cycleMeasureZ = SEN_START;
                cycleMeasure = WAITRBSTABLEZ;
//                DBG("C=1 START TIME MEASURE Z\n");
            }
        };
        while ((WAITRBSTABLEZ == cycleMeasure) && (0 == GET_IN0)) // Waiting 200ms
        {
            if(TIME_FINISH == timer_Status(TIMER_CLEARSENSOR))
            {
                /*Start couter*/
                timer_Start(TIMER_Z, TIMERMAXVALUE);
                minput.in1 = _OFF;
                msensor.s0 = _OFF;
                msensor.s1 = _OFF;
                getInput = GET_SENSOR;
                cycleMeasureZ = SEN_START;
                cycleMeasure = MEASUREZ;
//                DBG("MEASURE Z\n");
            }
        };
        /*Measure Z*/
        while ((MEASUREZ == cycleMeasure) && (0 == GET_IN0))
        {
            msensor = io_getSensor();
            minput = io_getInput();
            if((SEN_START == cycleMeasureZ) && (_ON == msensor.s0))
            {
                /*Stop couter X*/
                mmeasureValue.Z = time_Stop(TIMER_Z);
                cycleMeasureZ = SEN_FINISH;
                getInput = GET_SENSOR;
                cycleMeasure = CHECKZVALUE;
                XStatus = SENSORCHANGE;
//                DBG("SENSOR Z = ON\n");
            }
            if(_ON == minput.in1) // C=2
            {
                if(SEN_START == cycleMeasureZ)
                {
                    mmeasureValue.Z = 0;
                }
                cycleMeasureZ = SEN_FINISH;
                getInput = GET_SENSOR;
                cycleMeasure = CHECKZVALUE;
//                DBG("C=2 END MEASURE Z\n");
            }
        };
        /********************************************## 5 ##*******************************************/

        while (((CHECKZVALUE == cycleMeasure) || (Z_OK == cycleMeasure) || (Z_NOT_OK == cycleMeasure)) && (0 == GET_IN0))
        {
            msensor = io_getSensor();
            minput = io_getInput();
            if((CHECKZVALUE == cycleMeasure) && (_ON == minput.in1) && (_ON == msensor.s0) && (_ON == msensor.s1)) //C=2
            {
                minput.in1 = _OFF;
                moutput.out1 = _ON;
                io_setOutput(moutput);
                app_GetCurrentMeasureValue();
                time_Stop(TIMER_Z);
                mmeasureValue.X1 =  mCurrentMeasureValue.X1;
                mmeasureValue.Y1 =  mCurrentMeasureValue.Y1;
                mmeasureValue.X2 =  mCurrentMeasureValue.X2;
                mmeasureValue.Y2 =  mCurrentMeasureValue.Y2;
                app_SetCurrentMeasureValue();
                mdata.mode = ZONLY;
                app_CalculatorValue(cycleMeasure, mdata.mode);
                screen_DataMeasure(mdata, msetCalibValue);
                cycleMeasure = Z_OK;
                getInput = GET_BUTTON;
                XStatus = SENSORCHANGE;
                YStatus = SENSORCHANGE;
//                DBG("C=2 MEASURE Z OK\n");
            }
            else if((CHECKZVALUE == cycleMeasure) && (_ON == minput.in1) && ((_OFF == msensor.s0) || (_OFF == msensor.s1))) //C=2
            {
                minput.in1 = _OFF;
                moutput.out1 = _OFF;
                io_setOutput(moutput);
                time_Stop(TIMER_Z);
                cycleMeasure = Z_NOT_OK;
                getInput = GET_SENSOR;
                mdata.mode = ZERROR1;
                screen_DataMeasure(mdata, msetCalibValue);
                //delay(100);
//                DBG("C=2 MEASURE Z NOT OK\n");
            }
            if(((Z_OK == cycleMeasure) || (Z_NOT_OK == cycleMeasure)) && (_OFF == minput.in1))
            {
                cycleMeasure = WAITMEASUREX1Y1;
//                DBG("C=2 cycleMeasure = WAITMEASUREX1Y1\n");
            }
        }

        if((SETVALUEZ == cycleMeasure) && (_ON == mbutton.set) && (_ON == moutput.out1))
        {
            mledStatus.led3 = _ON;
            io_setLedStatus(mledStatus);
            cycleMeasure = WAITMEASUREX1Y1;
            getInput = GET_SENSOR;
//            DBG("SET Z\n");
            app_SetCalibValue();
            app_GetCalibValue();
        }
        /********************************************## 6 ##*******************************************/
        /*Robot di chuyển tới vị trí P5 Robot xuất tín hiệu cho X11*/
        while (((WAITMEASUREX1Y1 == cycleMeasure) || (SETVALUEZ == cycleMeasure)) && (0 == GET_IN0))
        {
            minput = io_getInput();
            if(_ON == minput.in1) //C=3
            {
                /*Start couter*/
                timer_Start(TIMER_CLEARSENSOR, TIMEWAITX11);
                minput.in1 = _OFF;
                moutput.out0 = _OFF;
                moutput.out1 = _OFF;
                io_setOutput(moutput);
                cycleMeasure = WAITRBSTABLEX1Y1;
                getInput = GET_SENSOR;
                cycleMeasureX = SEN_START;
                cycleMeasureY = SEN_START;
//                DBG("cycleMeasure = MEASUREX1Y1 C=3\n");
            }
        };
        while ((WAITRBSTABLEX1Y1 == cycleMeasure) && (0 == GET_IN0))
        {
            if(TIME_FINISH == timer_Status(TIMER_CLEARSENSOR))
            {
                /*Start couter*/
                timer_Start(TIMER_X, TIMERMAXVALUE);
                timer_Start(TIMER_Y, TIMERMAXVALUE);
                minput.in1 = _OFF;
                cycleMeasure = MEASUREX1Y1;
                getInput = GET_SENSOR;
                cycleMeasureX = SEN_START;
                cycleMeasureY = SEN_START;
//                DBG("Start couter X1, Y1\n");
            }
        };
        while ((MEASUREX1Y1 == cycleMeasure) && (0 == GET_IN0))
        {
            msensor = io_getSensor();
            minput = io_getInput();
            if((SEN_START == cycleMeasureX) && (_ON == msensor.s0))
            {
                /*Stop couter X*/
                mmeasureValue.X1 = time_Stop(TIMER_X);
                msensor.s0 = _OFF;
                cycleMeasureX = SEN_FINISH;
                getInput = GET_SENSOR;
                XStatus = SENSORCHANGE;
                DBG("X1 = SEN_FINISH\n");
                // DBG("mmeasureValue.X1 = %d\n",mmeasureValue.X1);
            }
            if((SEN_START == cycleMeasureY) && (_ON == msensor.s1))
            {
                /*Stop couter X*/
                mmeasureValue.Y1 = time_Stop(TIMER_Y);
                msensor.s1 = _OFF;
                cycleMeasureY = SEN_FINISH;
                getInput = GET_SENSOR;
                YStatus = SENSORCHANGE;
                DBG("Y1 = SEN_FINISH\n");
                // DBG("mmeasureValue.Y1 = %d\n",mmeasureValue.Y1);
            }
            if((SEN_FINISH == cycleMeasureX) && (SEN_FINISH == cycleMeasureY))
            {
                cycleMeasureX = SEN_STOP;
                cycleMeasureY = SEN_STOP;
                cycleMeasure = WAITMEASUREX2Y2;
                getInput = GET_SENSOR;
//                DBG("cycleMeasure = WAITMEASUREX2Y2\n");
            }
            //if(_ON == minput.in1) //C=4
            //{
            //    if(SEN_START == cycleMeasureX)
            //    {
            //        mmeasureValue.X1 = 0;
            //    }
            //    if(SEN_START == cycleMeasureY)
            //    {
            //        mmeasureValue.Y1 = 0;
            //    }
            //    cycleMeasureX = SEN_STOP;
            //    cycleMeasureY = SEN_STOP;
            //    cycleMeasure = WAITMEASUREX2Y2;
            //    getInput = GET_SENSOR;
            //    (void)time_Stop(TIMER_X);
            //    (void)time_Stop(TIMER_Y);
            //    DBG("MEASUREX1Y1 == cycleMeasure C=4\n");
            //}
        };
        /********************************************## 7 ##*******************************************/
        /*Robot di chuyển tới vị trí P10 Robot xuất tín hiệu cho X11*/
        while ((WAITMEASUREX2Y2 == cycleMeasure) && (0 == GET_IN0))
        {
            minput = io_getInput();
            if(_ON == minput.in1) // C=4
            {
                /*Start couter*/
                timer_Start(TIMER_CLEARSENSOR, TIMEWAITX11);
                minput.in1 = _OFF;
                cycleMeasure = WAITRBSTABLEX2Y2;
                getInput = GET_SENSOR;
                cycleMeasureX = SEN_START;
                cycleMeasureY = SEN_START;
//                DBG("cycleMeasure = WAITMEASUREX2Y2 C=4\n");
            }
        };
        while ((WAITRBSTABLEX2Y2 == cycleMeasure) && (0 == GET_IN0))
        {
            if(TIME_FINISH == timer_Status(TIMER_CLEARSENSOR))
            {
                /*Start couter*/
                timer_Start(TIMER_X, TIMERMAXVALUE);
                timer_Start(TIMER_Y, TIMERMAXVALUE);
                minput.in1 = _OFF;
                cycleMeasure = MEASUREX2Y2;
                getInput = GET_SENSOR;
                cycleMeasureX = SEN_START;
                cycleMeasureY = SEN_START;
//                DBG("Start couter X2, Y2\n");
            }
        };
        while ((MEASUREX2Y2 == cycleMeasure) && (0 == GET_IN0))
        {
            msensor = io_getSensor();
            if((SEN_START == cycleMeasureX) && (_ON == msensor.s0))
            {
                /*Stop couter X*/
                mmeasureValue.X2 = time_Stop(TIMER_X);
                msensor.s0 = _OFF;
                cycleMeasureX = SEN_FINISH;
                getInput = GET_SENSOR;
                XStatus = SENSORCHANGE;
//                DBG("X2 = SEN_FINISH\n");
            }
            if((SEN_START == cycleMeasureY) && (_ON == msensor.s1))
            {
                /*Stop couter X*/
                mmeasureValue.Y2 = time_Stop(TIMER_Y);
                msensor.s1 = _OFF;
                cycleMeasureY = SEN_FINISH;
                getInput = GET_SENSOR;
                YStatus = SENSORCHANGE;
//                DBG("Y2 = SEN_FINISH\n");
            }
            if((SEN_FINISH == cycleMeasureX) && (SEN_FINISH == cycleMeasureY))
            {
                /*Save D_X1, D_Y1*/
                cycleMeasureX = SEN_STOP;
                cycleMeasureY = SEN_STOP;
                cycleMeasure = WAITSETVALUE;
                getInput = GET_BUTTON;
//                DBG("WAITSETVALUE == cycleMeasure\n");
            }
            // if(_ON == minput.in1) //C=5
            // {
            //     if(SEN_START == cycleMeasureX)
            //     {
            //         mmeasureValue.X2 = 0;
            //     }
            //     if(SEN_START == cycleMeasureY)
            //     {
            //         mmeasureValue.Y2 = 0;
            //     }
            //     cycleMeasureX = SEN_STOP;
            //     cycleMeasureY = SEN_STOP;
            //     cycleMeasure = CALCULATORVALUE;
            //     getInput = GET_SENSOR;
            //     (void)time_Stop(TIMER_X);
            //     (void)time_Stop(TIMER_Y);
            // }
        };

        /*Robot di chuyển tới vị trí P18*/
        if((WAITSETVALUE == cycleMeasure) && (_ON == mbutton.set))
        {
            app_GetCalibValue();
            if ((0 == mcalibValue.X1) && (0 == mcalibValue.X2) && (0 == mcalibValue.Y1) && (0 == mcalibValue.Y2) && (0 == mcalibValue.Z) && (ZERROR1 != mdata.mode))
            {
                app_SetCalibValue();
                app_GetCalibValue();
                mledStatus.led3 = _ON;
                msetCalibValue = CALIBSET;
                io_setLedStatus(mledStatus);
            }
            getInput = GET_SENSOR;
            cycleMeasure = CALCULATORVALUE;
//            DBG("cycleMeasure = CALCULATORVALUE\n");
        }
        /********************************************## 8 ##*******************************************/
        if(((CALCULATORVALUE == cycleMeasure) || (WAITSETVALUE == cycleMeasure)) && (_ON == minput.in1)) // C=5
        {
            minput.in1 = _OFF;
            cycleMeasure = FINISH;
            getInput = GET_BUTTON;
            /*Calculator Value - Printf to screen*/
            app_SetCurrentMeasureValue();
            if(ZONLY == mdata.mode)
            {
                mdata.mode = MEASUREALL;
            }
            else if(ZERROR1 == mdata.mode)
            {
                mdata.mode = ZERROR2;
            }
            app_CalculatorValue(cycleMeasure,  mdata.mode);
            screen_DataMeasure(mdata, msetCalibValue);
//            DBG("cycleMeasure = FINISH C=5\n");
        }
    } while (0 == GET_IN0);

    app_TrigerOutputOFF();
    moutput.out0 = _OFF;
    moutput.out1 = _OFF;
    moutput.rl1  = _OFF;
    moutput.rl2  = _OFF;

    if((SENSORNOCHANGE == XStatus) || (SENSORNOCHANGE == YStatus))
    {
        moutput.out1 = _ON;
//        DBG("SENSOR IS NOT CHANGE\n");
    }
    else
    {
        moutput.out1 = _OFF;
//        DBG("SENSOR CHANGE\n");
    }
    io_setOutput(moutput);
    app_TrigerOutputON();
    if((NONE != mdata.mode) && (CALIBSET == msetCalibValue))
    {
        eep_WriteDataMeasure(&mdata);
    }
}

static void app_ClearAllOutput(void)
{
    moutput.out0 = _OFF;
    moutput.out1 = _OFF;
    moutput.rl1 = _OFF;
    io_setOutput(moutput);
}

