anhkhangluu/STM32/Firmware_IO/Core/Src/main.c
static void app_GetCurrentMeasureValue(void)
{
    (void)eep_ReadDataCurrent(&mCurrentMeasureValue);
//    DBG("mCurrentMeasureValue.X1 = %d\n",mCurrentMeasureValue.X1);
//    DBG("mCurrentMeasureValue.Y1 = %d\n",mCurrentMeasureValue.Y1);
//    DBG("mCurrentMeasureValue.X2 = %d\n",mCurrentMeasureValue.X2);
//    DBG("mCurrentMeasureValue.Y2 = %d\n",mCurrentMeasureValue.Y2);
//    DBG("mCurrentMeasureValue.Z = %d\n",mCurrentMeasureValue.Z);
}

static void app_SetCurrentMeasureValue(void)
{
    mCurrentMeasureValue.X1 = mmeasureValue.X1;
    mCurrentMeasureValue.Y1 = mmeasureValue.Y1;
    mCurrentMeasureValue.X2 = mmeasureValue.X2;
    mCurrentMeasureValue.Y2 = mmeasureValue.Y2;
    mCurrentMeasureValue.Z  = mmeasureValue.Z;
    (void)eep_WriteDataCurrent(&mCurrentMeasureValue);
//    DBG("mCurrentMeasureValue.X1 = %d\n",mCurrentMeasureValue.X1);
//    DBG("mCurrentMeasureValue.Y1 = %d\n",mCurrentMeasureValue.Y1);
//    DBG("mCurrentMeasureValue.X2 = %d\n",mCurrentMeasureValue.X2);
//    DBG("mCurrentMeasureValue.Y2 = %d\n",mCurrentMeasureValue.Y2);
//    DBG("mCurrentMeasureValue.Z = %d\n",mCurrentMeasureValue.Z);
}

static void app_CalculatorValue(CycleMeasure lcycleMeasures, uint8_t mode)
{
    double db_DetaTX1 = 0;
    double db_DetaTY1 = 0;
    double db_DetaTX2 = 0;
    double db_DetaTY2 = 0;
    double db_DetaTZ = 0;

    double  db_anpha1 = 0;
    double  db_beta1 = 0;
    double  db_anpha2 = 0;
    double  db_beta2 = 0;

    double db_Vrb1 = 20.0; /* mm/s */
    double db_Vrb2 = 20.0; /* mm/s */
    double db_R = 20.0;    /* mm */
    double db_D = 20.0;    /* mm */
    double db_a = 1.2;   /* mm */
    double db_b = 1.2;   /* mm */

    double db_DetaXSS1 = 0;
    double db_DetaYSS1 = 0;
    double db_DetaXSS2 = 0;
    double db_DetaYSS2 = 0;
    double db_DetaXRB1 = 0;
    double db_DetaYRB1 = 0;
    double db_DetaXRB2 = 0;
    double db_DetaYRB2 = 0;
    double db_DetaZ = 0;
    double db_r1 = 0;
    double db_r2 = 0;
    double db_LXSS = 0;
    double db_LYSS = 0;
    double db_LXRB = 0;
    double db_LYRB = 0;

    mdata.time = rtc_Now();
    if(CALIBSET == msetCalibValue)
    {
//        DBG("**********************************************************\n")
        /*calculator Z*/
        if((ZONLY == mode) || (MEASUREALL == mode))
        {
            db_DetaTZ  = ((double)(mmeasureValue.Z  - mcalibValue.Z))*100/1000000.0;  /* us/1000000 => s */
//            DBG("db_DetaTZ = %lf\n",db_DetaTZ);
            db_DetaZ = db_Vrb2 * db_DetaTZ;
//            DBG("db_DetaZ = %lf\n",db_DetaZ);
            mdata.coordinates.Z = (int16_t)(db_DetaZ * 100.0);
//            DBG("Z (db_DetaZ)= %lf\n",db_DetaZ);

            if((db_DetaZ > db_b) || (db_DetaZ < (-db_b)))
            {
                moutput.out3 = _ON;
            }
            else
            {
                moutput.out3 = _OFF;
            }
        }


        /*calculator X Y*/
        if (FINISH == lcycleMeasures)
        {
            db_DetaTX1 = ((double)(mmeasureValue.X1 - mcalibValue.X1))*100/1000000.0; /* us/1000000 => s */
            db_DetaTY1 = ((double)(mmeasureValue.Y1 - mcalibValue.Y1))*100/1000000.0; /* us/1000000 => s */
            db_DetaTX2 = ((double)(mmeasureValue.X2 - mcalibValue.X2))*100/1000000.0; /* us/1000000 => s */
            db_DetaTY2 = ((double)(mmeasureValue.Y2 - mcalibValue.Y2))*100/1000000.0; /* us/1000000 => s */
//            DBG("db_DetaTX1 = %lf\n",db_DetaTX1);
//            DBG("db_DetaTY1 = %lf\n",db_DetaTY1);
//            DBG("db_DetaTX2 = %lf\n",db_DetaTX2);
//            DBG("db_DetaTY2 = %lf\n",db_DetaTY2);

            db_anpha1 = (db_Vrb1*db_DetaTX1)/db_R;
            db_beta1  = (db_Vrb1*db_DetaTY1)/db_R;
            db_anpha2 = (db_Vrb2*db_DetaTX2)/db_R;
            db_beta2  = (db_Vrb2*db_DetaTY2)/db_R;
//            DBG("db_anpha1 = %lf\n",db_anpha1);
//            DBG("db_beta1 = %lf\n",db_beta1);
//            DBG("db_anpha2 = %lf\n",db_anpha2);
//            DBG("db_beta2 = %lf\n",db_beta2);

            db_DetaXSS1 = (2*db_R) * sin(db_anpha1/2) * cos(db_anpha1/2);
            db_DetaYSS1 = (2*db_R) * sin(db_beta1/2) * cos(db_beta1/2);
            db_DetaXRB1 = db_DetaXSS1 * cos(3.142/4);
            db_DetaYRB1 = db_DetaYSS1 * cos(3.142/4);
//            DBG("db_DetaXSS1 = %lf\n",db_DetaXSS1);
//            DBG("db_DetaYSS1 = %lf\n",db_DetaYSS1);
//            DBG("db_DetaXRB1 = %lf\n",db_DetaXRB1);
//            DBG("db_DetaYRB1 = %lf\n",db_DetaYRB1);

            db_DetaXSS2 = (2*db_R) * sin(db_anpha2/2) * cos(db_anpha2/2);
            db_DetaYSS2 = (2*db_R) * sin(db_beta2/2) * cos(db_beta2/2);
            db_DetaXRB2 = db_DetaXSS2 * cos(3.142/4);
            db_DetaYRB2 = db_DetaYSS2 * cos(3.142/4);
//            DBG("db_DetaXSS2 = %lf\n",db_DetaXSS2);
//            DBG("db_DetaYSS2 = %lf\n",db_DetaYSS2);
//            DBG("db_DetaXRB2 = %lf\n",db_DetaXRB2);
//            DBG("db_DetaYRB2 = %lf\n",db_DetaYRB2);

            db_r1 = sqrt((db_DetaYSS1 * db_DetaYSS1) + (db_DetaXSS1 * db_DetaXSS1));
            db_r2 = sqrt((db_DetaYSS2 * db_DetaYSS2) + (db_DetaXSS2 * db_DetaXSS2));
//            DBG("db_r1 = %lf\n",db_r1);
//            DBG("db_r2 = %lf\n",db_r2);

            db_LXSS = (atan((db_DetaXSS2 - db_DetaXSS1)/db_D)*180)/3.142;
            db_LYSS = (atan((db_DetaYSS2 - db_DetaYSS1)/db_D)*180)/3.142;
            db_LXRB = (atan((db_DetaXRB2 - db_DetaXRB1)/db_D)*180)/3.142;
            db_LYRB = (atan((db_DetaYRB2 - db_DetaYRB1)/db_D)*180)/3.142;
//            DBG("db_LXSS = %lf\n",db_LXSS);
//            DBG("db_LYSS = %lf\n",db_LYSS);
//            DBG("db_LXRB = %lf\n",db_LXRB);
//            DBG("db_LYRB = %lf\n",db_LYRB);

            mdata.coordinates.X = (int16_t)(db_DetaXRB2 * 100.0);
            mdata.coordinates.Y = (int16_t)(db_DetaYRB2 * 100.0);

            mdata.coordinates.R = (int16_t)(db_r2 * 100.0);
            mdata.coordinates.aX = (int16_t)(db_LXRB * 10.0);
            mdata.coordinates.aY = (int16_t)(db_LYRB * 10.0);
//            DBG("X (db_DetaXRB2) = %lf\n",db_DetaXRB2);
//            DBG("Y (db_DetaYRB2)= %lf\n",db_DetaYRB2);
//            DBG("R (db_r2)= %lf\n",db_r2);
//            DBG("A (db_LXRB) = %lf\n",db_LXRB);
//            DBG("B (db_LYRB)= %lf\n",db_LYRB);
//            DBG("X1 (db_DetaXRB1)= %lf\n",db_DetaXRB1);
//            DBG("Y1 (db_DetaYRB1)= %lf\n",db_DetaYRB1);
            if(db_r2 > db_a)
            {
                moutput.out2 = _ON;
            }
            else
            {
                moutput.out2 = _OFF;
            }
        }
        io_setOutput(moutput);
    }
}

