anhkhangluu/STM32/Firmware_IO/Core/Src/main.c
static void app_SetCalibValue(void)
{
    mcalibValue.X1 = mmeasureValue.X1;
    mcalibValue.Y1 = mmeasureValue.Y1;
    mcalibValue.X2 = mmeasureValue.X2;
    mcalibValue.Y2 = mmeasureValue.Y2;
    mcalibValue.Z  = mmeasureValue.Z;
    eep_WriteDataCalib(&mcalibValue);
//    DBG("mcalibValue.X1 = %d\n",mcalibValue.X1);
//    DBG("mcalibValue.Y1 = %d\n",mcalibValue.Y1);
//    DBG("mcalibValue.X2 = %d\n",mcalibValue.X2);
//    DBG("mcalibValue.Y2 = %d\n",mcalibValue.Y2);
//    DBG("mcalibValue.Z = %d\n",mcalibValue.Z);
}

static void app_GetCalibValue(void)
{
    eep_ReadDataCalib(&mcalibValue);
//    DBG("mcalibValue.X1 = %d\n",mcalibValue.X1);
//    DBG("mcalibValue.Y1 = %d\n",mcalibValue.Y1);
//    DBG("mcalibValue.X2 = %d\n",mcalibValue.X2);
//    DBG("mcalibValue.Y2 = %d\n",mcalibValue.Y2);
//    DBG("mcalibValue.Z = %d\n",mcalibValue.Z);
}

static void app_TrigerOutputOFF(void)
{
    moutput.rl2 = _OFF;
    io_setOutput(moutput);
    delay(100);
}

static void app_TrigerOutputON(void)
{
    delay(100);
    moutput.rl2 = _ON;
    io_setOutput(moutput);
}

static optionScreen_e_t app_optionMenu(void)
{
	optionScreen_e_t optionIndex = measurement1Setting;
	uint8_t exit = 0;

	do {
		mbutton = io_getButton();
		if (mbutton.next == _ON) {
			while (_ON == io_getButton().next)
				;
			LCD_Clear();
			screen_OptionMenu(optionIndex);
			optionIndex++;
		}

		if (mbutton.prev == _ON) {
			while (_ON == io_getButton().prev)
				;
			LCD_Clear();
			optionIndex--;
			screen_OptionMenu(optionIndex);
		}

		if (mbutton.set == _ON) {
			while (_ON == io_getButton().set)
				;
			exit = 1;
		}

		if(mbutton.menu == _ON)
		{
			while (_ON == io_getButton().menu)
				;
			exit = 1;
		}

	} while (exit == 0);
	return optionIndex;
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
